// ==============================
// setTimeout
// ==============================

// 1. Сделай задержку 3 секунды, после чего в консоли появится "Прошло 3 секунды".


// 2. Создай функцию delayLog(text, delay), которая выводит text через delay миллисекунд.


// ==============================
// setInterval + clearInterval
// ==============================

// 3. Каждую секунду выводи "Тик...", пока не выведется 10 раз.


// ==============================
// PROMISE
// ==============================

// 4. Создай Promise, который через 1 секунду возвращает "Готово".


// 5. Напиши функцию getUser(success), которая возвращает Promise:
// Если success === true → resolve("Пользователь найден")
// Иначе → reject("Ошибка поиска")


// ==============================
// async / await
// ==============================

// 6. Напиши функцию async loadInfo(), которая ждёт 2 секунды и возвращает "Информация загружена"


// ==============================
// fetch (запрос к API)
// ==============================

// 7. Получи список пользователей с jsonplaceholder.typicode.com (https://jsonplaceholder.typicode.com/users) и выведи их имена

