// Задача 1. Запросить у пользователя два числа, сложить их и вывести результат.




// Задача 2. Запросить у пользователя число и определить, положительное оно, отрицательное или ноль.
// if, else, else if / Тернарный оператор (? :) / switch...case / ??



// Задача 3. Вывести числа от 1 до 10 в браузер.
// for / while / do...while / break / continue



// Задача 4. Написать функцию, которая возвращает большее из двух чисел.




// Задача 5. Найти сумму всех элементов массива [2, 5, 10, 3, 7].




// Задача 6. Создать объект с данными пользователя и вывести его имя.


