// 1. Задание:
// Создай функцию getSquare(num), используя Function Declaration.
// Попробуй вызвать её до и после объявления.
// Функция должна возвращать квадрат числа.






// 2. Задание:
// Создай функцию subtract(a, b), используя Function Expression.
// Попробуй вызвать её до объявления – должна быть ошибка.
// После объявления вызови ещё раз – функция должна корректно отработать.






// 3. Задание:
// Создай две функции divide и divideArrow, используя Function Expression и Arrow Function.
// Обе функции должны делить первое число на второе.






// 4. Задание:
// Создай объект person с полем name и методом introduce, используя Function Expression.
// Метод должен выводить Привет, меня зовут <name>!.





// 5. Задание:
// Создай две функции concatStrings1 и concatStrings2,
// используя Function Declaration и Function Expression,
// которые объединяют две строки.






// 6. Задание:
// Создай Function Expression, которая принимает возраст и возвращает "Совершеннолетний" если age >= 18, иначе "Несовершеннолетний".









// --------------------------------------------------------------------------------------------------
// 1. Создай новый массив, где к каждому числу добавляется 10.






// 2. Преобразуй массив строк в массив их длин.






// 3. Выведи в консоль каждый элемент массива с его индексом.





// 4. Умножь все числа массива на 3 и выведи их в консоль.





// 5. Оставь только числа больше 2.





// 6. Из массива строк оставь только слова длиной больше 5 символов.




// 7. Найди произведение всех элементов массива.




// 8. Из массива объектов получи сумму всех цен.




// 9. Найди первый элемент больше 2 в массиве чисел.




// 10. Найди пользователя с именем "Арназ".




// 11. Найди индекс первого четного числа.




// 12. Найди индекс имени длиной больше 4 символов.





// 13. Есть ли хотя бы одно нечетное число?




// 14. Есть ли имя длиной больше 10 символов?




// 15. Все ли числа больше 0?




// 16. Все ли имена начинаются с заглавной буквы?





// 17. Отсортируй массив строк по длине слов.




// 18. Отсортируй массив объектов по возрастанию id.




// 19. Переверни массив чисел.




// 20. Переверни массив имен.




// 21. Разверни массив на один уровень вложенности.




// 22. Разверни полностью глубоко вложенный массив.




// 23. Объедини массив букв в строку без пробелов.




// 24. Объедини массив чисел через запятую.